person/seifert.org
#+HTML_HEAD: <link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />
#+title: seifert

* (1934) (seifert and threlfall) lehrbuchder topologie [a textbook of topology]

*** 1 例子 / illustrative material

***** 1 拓扑学的基本问题 / the principal problem of topology

      - 拓扑学的研究对象是几何图形
        所研究的几何图形的性质 是其在拓扑映射下不变的性质

        所谓 拓扑映射
        就是 连续的一一映射 并且其逆映射也是连续的

        所谓 几何图形
        是三维或者更高维空间之中的点集

        - x -
          在描述点集时
          我们可以局限于如下的方法
          几何图形 被分为一片一片的
          对其中的每一片
          我们给以其参数表示
          片与片之间的关系需要被加以限定
          但是具体如何限定
          先暂且不谈

      - 连续函数只需要定义于几何图形之中的点
        而不需要定义于几何图形所在的整个空间中的所有点

      - 在拓扑映射下不变的性质
        称为拓扑性质

      - 两个图形
        如果可以被某个拓扑映射变换为另一个
        就称这两个图形同胚

      - 如果在直觉上
        一个图形经过扭曲和形变可以变为另一个
        那么二者就是同胚的

      - 想要发现很多很多同胚的图形很容易
        然是想要证明两个图形不同胚则很难

      - 正如全等的图形在欧式几何中被认为是没有本质上的区别的
        同胚的图形在拓扑学中也被认为是没有本质上的区别的

        两个全等的图形总是可以通过一个整个空间的叠合变换而被重叠
        但是 可能没有整个空间的同胚变换来重叠两个同胚的图形

        比如
        在三维空间中
        结 与 圈 同胚
        不经扭曲的闭合的带 与 莫比乌斯带 同胚
        但是这些同胚都不能扩展到整个空间到自身的拓扑映射

        然而
        当把这些图形嵌入在四维空间中时
        这些同胚却又可以扩展到整个空间到自身的拓扑映射了

        如此更可以看出 同胚 这个等价关系
        是就图形的点而言的
        而不是就图形所在的空间而言的

      - 因此我们必须区分两种拓扑性质
        一种是内蕴于图形本身的拓扑性质
        另一种拓扑性质 是关于图形如何被放置于外在的空间之中的
        后一种拓扑性质 在外在空间的拓扑映射下不变

        在观察图形与外在空间的关系时
        所得到的一些差异
        在考虑内蕴的拓扑时
        可能就不复存在了

      - 这里所区分的 内蕴性质与外在性质
        在微分几何中同样也会出现
        三维空间中曲面的内蕴度量性质由其第一基本形式决定 [first fundamental form]
        而外在的度量性质由其第二基本形式决定 [second fundamental form]

      - 拓扑学的基本问题是
        判断两个图形是否同胚
        并且分类列举所有不同胚的图形

        尽管人们发展出了很多理论来处理欧式空间的任意子空间
        但是我们将限制我们讨论的对象
        以避免集合论所带来的困难

        我们首先限制我们的研究对象于
        布劳威尔[Brouwer] 所引入的 复形[complex]
        然后进一步局限于 流形[manifold]

      - 复形之有别于任意点集所构成的图形
        在于它们可以被 三角化 [或者说单形化]

        与其说对一个已有的空间进行三角化
        也可以说是利用单形来构造复形
        这后一种构造是不依赖于外在空间而内蕴的

        - x -
          因此 作者在这里考虑的是 单纯复形[simplicial complex]

      - 可三角化 这个性质
        将为我们排除点集拓扑中的很多病态情形

        尽管复形的拓扑学被戏称为 '橡皮糖拓扑学'
        但是其实经过这样的限制之后
        我们恰恰可以把精力集中于具有更强几何意义的研究对象

      - 在尝试研究拓扑学的基本问题的过程中
        人们找到了很多关于复形的拓扑不变量
        利用这些不变量 我们可以区分不同胚的复形

        其中最重要的两个不变量
        是复形的同调群与基本群
        这将是我们研究的核心

      - 然而我们现在却要试试
        在不利用这两个不变量的情形下
        来研究研究拓扑学的基本问题

        - x -
          因此我们目前的主要工具就是直觉与想象

        首先我们问
        不同胚的闭曲面都由哪些 ?

***** 2 闭曲面 / closed surfaces

      - ><

***** 3 isotopy, homotopy, homology

***** 4 higher dimensional manifolds

*** 2 simplicial complexes

***** 5 neighborhood spaces

***** 6 mappings

***** 7 point sets in euclidean spaces

***** 8 identification spaces

***** 9 n-simplexes

