person/seifert.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2017-05-26 Fri 06:00 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>seifert</title>
<meta name="generator" content="Org-mode" />
<meta name="author" content="XIE Yuheng" />
<link rel="stylesheet" href="../asset/css/page.css" type="text/css" media="screen" />
</head>
<body>
<div id="preamble" class="status">
近死之心 莫使復陽也
</div>
<div id="content">
<h1 class="title">seifert</h1>
<div id="table-of-contents">
<h2>overview</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org7e0c1e4">(1934) (seifert and threlfall) lehrbuchder topologie [a textbook of topology]</a>
<ul>
<li><a href="#org3232156">1 例子 / illustrative material</a>
<ul>
<li><a href="#org183a7c9">1 拓扑学的基本问题 / the principal problem of topology</a></li>
<li><a href="#org959a139">2 闭曲面 / closed surfaces</a></li>
<li><a href="#orgd99491f">3 isotopy, homotopy, homology</a></li>
<li><a href="#org4b63f77">4 higher dimensional manifolds</a></li>
</ul>
</li>
<li><a href="#org96a8c1">2 simplicial complexes</a>
<ul>
<li><a href="#orgec37d33">5 neighborhood spaces</a></li>
<li><a href="#org1d78d0e">6 mappings</a></li>
<li><a href="#orgd693478">7 point sets in euclidean spaces</a></li>
<li><a href="#org98c6934">8 identification spaces</a></li>
<li><a href="#org670fc4">9 n-simplexes</a></li>
<li><a href="#org3cb6208">10 simplicial complexes</a></li>
<li><a href="#orgc9b2eeb">11 the schema of a simplicial complex</a></li>
<li><a href="#orgce6c004">12 finite, pure, homogeneous complexes</a></li>
<li><a href="#org13ca656">13 normal subdivision</a></li>
<li><a href="#org6ef5ed5">14 examples of complexes</a></li>
</ul>
</li>
<li><a href="#org9a8dd0">3 homology groups</a>
<ul>
<li><a href="#org26171ee">15 chains</a></li>
<li><a href="#org6d07a80">16 boundary, closed chains</a></li>
<li><a href="#orgc1deb97">17 homologous chains</a></li>
<li><a href="#org83546da">18 homology groups</a></li>
<li><a href="#org22dd115">19 computation of the homology groups in simple cases</a></li>
<li><a href="#orgaf874a5">20 homologies with division</a></li>
<li><a href="#org850052d">21 computation of homology groups from the incidence matrices</a></li>
<li><a href="#org219f62f">22 block chains</a></li>
<li><a href="#orge9c1a88">23 chains mod 2, connectivity numbers, euler's formula</a></li>
<li><a href="#orgeabf1f9">24 pseudomanifolds and orientability</a></li>
</ul>
</li>
<li><a href="#orge2987ae">4 simplicial approximations</a>
<ul>
<li><a href="#org6c5d110">25 singular simplexes</a></li>
<li><a href="#org622388c">26 singular chains</a></li>
<li><a href="#org90e8734">27 singular homology groups</a></li>
<li><a href="#orgdc56332">28 the approximation theorem, invariance of simplicial homology groups</a></li>
<li><a href="#org51559c6">29 prisms in euclidean spaces</a></li>
<li><a href="#org713b1ee">30 proof of the approximation theorem</a></li>
<li><a href="#org5120446">31 deformation and simplicial approximation of mappings</a></li>
</ul>
</li>
<li><a href="#org5da6f53">5 local properties</a>
<ul>
<li><a href="#org8482184">32 homology groups of a complex at a point</a></li>
<li><a href="#org974e238">33 invariance of dimension</a></li>
<li><a href="#org8a668b3">34 invariance of the purity of a complex</a></li>
<li><a href="#org192aabf">35 invariance of boundary</a></li>
<li><a href="#org581015d">36 invariance of pseudomanifolds and of orientability</a></li>
</ul>
</li>
<li><a href="#orgf8afe5d">6 surface topology</a>
<ul>
<li><a href="#orgb6432d3">intro</a></li>
<li><a href="#org2c8c5ac">37 closed surfaces</a></li>
<li><a href="#org7563ee6">38 transformation to normal form</a></li>
<li><a href="#orga3020e0">39 types of normal form: the principal theorem</a></li>
<li><a href="#org10f4374">40 surfaces with boundary</a></li>
<li><a href="#orgdb7f74d">41 homology groups of surfaces</a></li>
</ul>
</li>
<li><a href="#org75fcd58">7 the fundamental group</a>
<ul>
<li><a href="#org2243fd2">42 the fundamental group</a></li>
<li><a href="#orgafe8860">43 examples</a></li>
<li><a href="#orga2c571b">44 the edge path group of a simplicial complex</a></li>
<li><a href="#orge07eca7">45 the edge path group of a surface complex</a></li>
<li><a href="#orgc6ada70">46 generators and relations</a></li>
<li><a href="#org78b9965">47 edge complexes and closed surfaces</a></li>
<li><a href="#orgfc0ddb">48 the fundamental and homology groups</a></li>
<li><a href="#org43c17d4">49 free deformation of closed paths</a></li>
<li><a href="#org96f7f8e">50 fundamental group and deformation of mappings</a></li>
<li><a href="#org9a56cf0">51 the fundamental group at a point</a></li>
<li><a href="#orgf0d56b0">52 the fundamental group of a composite complex</a></li>
</ul>
</li>
<li><a href="#org6a661d0">8 covering complexes</a>
<ul>
<li><a href="#orge0beba0">intro</a></li>
<li><a href="#org587d248">53 unbranched covering complexes</a></li>
<li><a href="#org9d662df">54 base path and covering path</a></li>
<li><a href="#orgf6e99ae">55 coverings and subgroups of the fundamental group</a></li>
<li><a href="#orgf3b8aea">56 universal coverings</a></li>
<li><a href="#org8401882">57 regular coverings</a></li>
<li><a href="#org9f7d797">58 the monodromy group</a></li>
</ul>
</li>
<li><a href="#org6d06421">9 3-dimensional manifolds</a>
<ul>
<li><a href="#orgfe7eefc">59 general principles</a></li>
<li><a href="#orgfd7f7ff">60 representation by a polyhedron</a></li>
<li><a href="#orge75224b">61 homology groups</a></li>
<li><a href="#org9deb993">62 the fundamental group</a></li>
<li><a href="#orgb9619a0">63 the heegaard diagram</a></li>
<li><a href="#orgb5ddcf">64 3-dimensional manifolds with boundary</a></li>
<li><a href="#org8731e58">65 construction of 3-dimensional manifolds out of knots</a></li>
</ul>
</li>
<li><a href="#orgba47678">10 n-dimensional manifolds</a>
<ul>
<li><a href="#org2f1da8a">66 star complexes</a></li>
<li><a href="#org84c7fac">67 cell complexes</a></li>
<li><a href="#org554ab6a">68 manifolds</a></li>
<li><a href="#org510ca6c">69 the poincare duality theorem</a></li>
<li><a href="#orgc4df8c0">70 intersection numbers of cell chains</a></li>
<li><a href="#org55491fb">71 dual bases</a></li>
<li><a href="#org491b98e">72 cellular approximations</a></li>
<li><a href="#org8c968d5">73 intersection numbers of singular chains</a></li>
<li><a href="#org2cbff4">74 invariance of intersection numbers</a></li>
<li><a href="#org5bc69ae">75 examples</a></li>
<li><a href="#org983c01">76 orientability and two-sidedness</a></li>
<li><a href="#orgc2bf78c">77 linking numbers</a></li>
</ul>
</li>
<li><a href="#org72b5ff9">11 continuous mappings</a>
<ul>
<li><a href="#org5fbb5f0">78 the degree of a mappings</a></li>
<li><a href="#orgef85df8">79 a trace formula</a></li>
<li><a href="#org8390b6b">80 a fixed point formula</a></li>
<li><a href="#orgdbaa53b">81 applications</a></li>
</ul>
</li>
<li><a href="#orgb1042a4">12 auxiliary theorems from the theory of groups</a>
<ul>
<li><a href="#org10e05c1">82 generators and relations</a></li>
<li><a href="#orgd181b8c">83 homomorphic mappings and factor groups</a></li>
<li><a href="#org707c55c">84 abelianization of groups</a></li>
<li><a href="#org1348852">85 free and direct products</a></li>
<li><a href="#org11d6d06">86 abelian groups</a></li>
<li><a href="#orgd43a83e">87 the normal form of integer matrices</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org4377545">[topology of 3-dimensional fibered spaces]</a>
<ul>
<li><a href="#org855e0fb">fibered spaces</a></li>
<li><a href="#org68fc307">orbit surface</a></li>
<li><a href="#org982f86a">fiberings of s3</a></li>
<li><a href="#org7655254">triangulations of fibered spaces</a></li>
<li><a href="#org699400a">drilling and filling (surgery)</a></li>
<li><a href="#org4659de5">classes of fibered spaces</a></li>
<li><a href="#orgf4175cd">the orientable fibered spaces</a></li>
<li><a href="#orgf8f1fc1">the nonorientable fibered spaces</a></li>
<li><a href="#org9e9ed6c">covering spaces</a></li>
<li><a href="#org911be3a">fundamental groups of fibered spaces</a></li>
<li><a href="#orga96b1a1">fiberings of the 3-sphere (complete list)</a></li>
<li><a href="#orgcb39b59">the fibered poincare spaces</a></li>
<li><a href="#org5e0b10c">constructing poincare spaces from torus knots</a></li>
<li><a href="#org7d80108">translation groups of fibered spaces</a></li>
<li><a href="#orgfffd0b8">spaces which cannot be fibered</a></li>
<li><a href="#org1d8e034">appendix: branched coverings</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-org7e0c1e4" class="outline-2">
<h2 id="org7e0c1e4">(1934) (seifert and threlfall) lehrbuchder topologie [a textbook of topology]</h2>
<div class="outline-text-2" id="text-org7e0c1e4">
</div><div id="outline-container-org3232156" class="outline-3">
<h3 id="org3232156">1 例子 / illustrative material</h3>
<div class="outline-text-3" id="text-org3232156">
</div><div id="outline-container-org183a7c9" class="outline-4">
<h4 id="org183a7c9">1 拓扑学的基本问题 / the principal problem of topology</h4>
<div class="outline-text-4" id="text-org183a7c9">
<ul class="org-ul">
<li><p><p></p><p>拓扑学的研究对象是几何图形</p><p>所研究的几何图形的性质 是其在拓扑映射下不变的性质</p><p></p></p><p></p><p><p></p><p>所谓 拓扑映射</p><p>就是 连续的一一映射 并且其逆映射也是连续的</p><p></p></p><p></p><p><p></p><p>所谓 几何图形</p><p>是三维或者更高维空间之中的点集</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>x -</p><p>在描述点集时</p><p>我们可以局限于如下的方法</p><p>几何图形 被分为一片一片的</p><p>对其中的每一片</p><p>我们给以其参数表示</p><p>片与片之间的关系需要被加以限定</p><p>但是具体如何限定</p><p>先暂且不谈</p></li></ul></p></li>

<li><p>连续函数只需要定义于几何图形之中的点</p><p>而不需要定义于几何图形所在的整个空间中的所有点</p></li>

<li><p>在拓扑映射下不变的性质</p><p>称为拓扑性质</p></li>

<li><p>两个图形</p><p>如果可以被某个拓扑映射变换为另一个</p><p>就称这两个图形同胚</p></li>

<li><p>如果在直觉上</p><p>一个图形经过扭曲和形变可以变为另一个</p><p>那么二者就是同胚的</p></li>

<li><p>想要发现很多很多同胚的图形很容易</p><p>然是想要证明两个图形不同胚则很难</p></li>

<li><p><p></p><p>正如全等的图形在欧式几何中被认为是没有本质上的区别的</p><p>同胚的图形在拓扑学中也被认为是没有本质上的区别的</p><p></p></p><p></p><p><p></p><p>两个全等的图形总是可以通过一个整个空间的叠合变换而被重叠</p><p>但是 可能没有整个空间的同胚变换来重叠两个同胚的图形</p><p></p></p><p></p><p><p></p><p>比如</p><p>在三维空间中</p><p>结 与 圈 同胚</p><p>不经扭曲的闭合的带 与 莫比乌斯带 同胚</p><p>但是这些同胚都不能扩展到整个空间到自身的拓扑映射</p><p></p></p><p></p><p><p></p><p>然而</p><p>当把这些图形嵌入在四维空间中时</p><p>这些同胚却又可以扩展到整个空间到自身的拓扑映射了</p><p></p></p><p></p><p><p></p><p>如此更可以看出 同胚 这个等价关系</p><p>是就图形的点而言的</p><p>而不是就图形所在的空间而言的</p><p></p></p></li>

<li><p><p></p><p>因此我们必须区分两种拓扑性质</p><p>一种是内蕴于图形本身的拓扑性质</p><p>另一种拓扑性质 是关于图形如何被放置于外在的空间之中的</p><p>后一种拓扑性质 在外在空间的拓扑映射下不变</p><p></p></p><p></p><p><p></p><p>在观察图形与外在空间的关系时</p><p>所得到的一些差异</p><p>在考虑内蕴的拓扑时</p><p>可能就不复存在了</p><p></p></p></li>

<li><p>这里所区分的 内蕴性质与外在性质</p><p>在微分几何中同样也会出现</p><p>三维空间中曲面的内蕴度量性质由其第一基本形式决定 [first fundamental form]</p><p>而外在的度量性质由其第二基本形式决定 [second fundamental form]</p></li>

<li><p><p></p><p>拓扑学的基本问题是</p><p>判断两个图形是否同胚</p><p>并且分类列举所有不同胚的图形</p><p></p></p><p></p><p><p></p><p>尽管人们发展出了很多理论来处理欧式空间的任意子空间</p><p>但是我们将限制我们讨论的对象</p><p>以避免集合论所带来的困难</p><p></p></p><p></p><p><p></p><p>我们首先限制我们的研究对象于</p><p>布劳威尔[Brouwer] 所引入的 复形[complex]</p><p>然后进一步局限于 流形[manifold]</p><p></p></p></li>

<li><p><p></p><p>复形之有别于任意点集所构成的图形</p><p>在于它们可以被 三角化 [或者说单形化]</p><p></p></p><p></p><p><p></p><p>与其说对一个已有的空间进行三角化</p><p>也可以说是利用单形来构造复形</p><p>这后一种构造是不依赖于外在空间而内蕴的</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>x -</p><p>因此 作者在这里考虑的是 单纯复形[simplicial complex]</p></li></ul></p></li>

<li><p><p></p><p>可三角化 这个性质</p><p>将为我们排除点集拓扑中的很多病态情形</p><p></p></p><p></p><p><p></p><p>尽管复形的拓扑学被戏称为 '橡皮糖拓扑学'</p><p>但是其实经过这样的限制之后</p><p>我们恰恰可以把精力集中于具有更强几何意义的研究对象</p><p></p></p></li>

<li><p><p></p><p>在尝试研究拓扑学的基本问题的过程中</p><p>人们找到了很多关于复形的拓扑不变量</p><p>利用这些不变量 我们可以区分不同胚的复形</p><p></p></p><p></p><p><p></p><p>其中最重要的两个不变量</p><p>是复形的同调群与基本群</p><p>这将是我们研究的核心</p><p></p></p></li>

<li><p><p></p><p>然而我们现在却要试试</p><p>在不利用这两个不变量的情形下</p><p>来研究研究拓扑学的基本问题</p><p></p></p><p></p><p><ul class="org-ul"></p><p><li><p>x -</p><p>因此我们目前的主要工具就是直觉与想象</p></li></ul></p><p><p></p><p>首先我们问</p><p>不同胚的闭曲面都由哪些 ?</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org959a139" class="outline-4">
<h4 id="org959a139">2 闭曲面 / closed surfaces</h4>
<div class="outline-text-4" id="text-org959a139">
<ul class="org-ul">
<li><p>&gt;&lt;</p></li></ul>
</div>
</div>

<div id="outline-container-orgd99491f" class="outline-4">
<h4 id="orgd99491f">3 isotopy, homotopy, homology</h4>
</div>

<div id="outline-container-org4b63f77" class="outline-4">
<h4 id="org4b63f77">4 higher dimensional manifolds</h4>
</div>
</div>

<div id="outline-container-org96a8c1" class="outline-3">
<h3 id="org96a8c1">2 simplicial complexes</h3>
<div class="outline-text-3" id="text-org96a8c1">
</div><div id="outline-container-orgec37d33" class="outline-4">
<h4 id="orgec37d33">5 neighborhood spaces</h4>
</div>

<div id="outline-container-org1d78d0e" class="outline-4">
<h4 id="org1d78d0e">6 mappings</h4>
</div>

<div id="outline-container-orgd693478" class="outline-4">
<h4 id="orgd693478">7 point sets in euclidean spaces</h4>
</div>

<div id="outline-container-org98c6934" class="outline-4">
<h4 id="org98c6934">8 identification spaces</h4>
</div>
