person/seifert.org
***** 10 simplicial complexes

***** 11 the schema of a simplicial complex

***** 12 finite, pure, homogeneous complexes

***** 13 normal subdivision

***** 14 examples of complexes

*** 3 homology groups

***** 15 chains

***** 16 boundary, closed chains

***** 17 homologous chains

***** 18 homology groups

***** 19 computation of the homology groups in simple cases

***** 20 homologies with division

***** 21 computation of homology groups from the incidence matrices

***** 22 block chains

***** 23 chains mod 2, connectivity numbers, euler's formula

***** 24 pseudomanifolds and orientability

*** 4 simplicial approximations

***** 25 singular simplexes

***** 26 singular chains

***** 27 singular homology groups

***** 28 the approximation theorem, invariance of simplicial homology groups

***** 29 prisms in euclidean spaces

***** 30 proof of the approximation theorem

***** 31 deformation and simplicial approximation of mappings

*** 5 local properties

***** 32 homology groups of a complex at a point

***** 33 invariance of dimension

***** 34 invariance of the purity of a complex

***** 35 invariance of boundary

***** 36 invariance of pseudomanifolds and of orientability

*** 6 surface topology

***** intro

      - The principal problem of topology,
        the homeomorphism problem,
        can be solved in dimension 2,
        using methods which cannot be generalized to higher dimensions.

        For this reason we shall develop surface topology
        independently of our previous results,
        which were valid for arbitrary dimension.

        We shall start with polygons,
        instead of with a simplicial complex,
        and we shall construct closed polyhedral surfaces
        by identifying sides of polygons.

***** 37 closed surfaces

      - [manifold-checker]
        We first devote our attention only to systems of polygons
        for which the total number of sides is even
        and each side is paired with exactly one otherside
        by the topological mapping.

      - [topological feeling [neighborhood space]]
        In the system of polygons,
        points which map into one another
        are to be considered equivalent
        in the sense that
        points in a neighborhood space are equivalent.

      - [combinatorial natural of a system of polygons]
        We can then recognize the following classes of equivalent points
        in a system of polygons :
        - an inner point of a polygon is equivalent only to itself;
        - an innerpoint of a polygonal side
          is equivalent to exactly one other point;
        - a vertex may be equivalent to one, several, or even no other points.

      - [connectedness condition]

      - system of polygons -> closed surfaces

      - In the treatment which follows,
        our interest shall be not in the particular system of polygons
        but, rather, in the surface which it determines.

        We now set ourselves the task of discovering
        when two systems of polygons determine the same surface,
        that is, finding when the polyhedral surfaces
        produced by the identification of equivalent points
        are different polygonal decompositions of the same surface.

        [we solve this by normalization]

      - [orientation]
        We now orient the polygonal sides.
        That is, we choose one of the two boundary points of each side
        as initial point
        and the other as endpoint of the side.

        - x -
          such orientation is nothing but maintain the information
          of different positions in the boundary of a n-disk.

        - k -
          but a polygon only has two orientations.

          while so much information are maintained,
          are they really the information about orientation ?

      - The orientation of the polygon
        will determine a sense of traversal of the boundary,
        that is, a cyclic ordering of the sides.

        [is this the same for polyhedron ?]

***** 38 transformation to normal form

******* Step 1

******* Step 2: Side Cancellation

******* Step 3: Transformation to a Polyhedral Surface Having a Single Vertex

******* Step 4: Cross-Cap Normalization

******* Step 5: Handle Normalization

******* Step 6: Transformation of the Handles into Cross-Caps

***** 39 types of normal form: the principal theorem

***** 40 surfaces with boundary

***** 41 homology groups of surfaces

*** 7 the fundamental group

***** 42 the fundamental group

***** 43 examples

***** 44 the edge path group of a simplicial complex

***** 45 the edge path group of a surface complex

***** 46 generators and relations

***** 47 edge complexes and closed surfaces

***** 48 the fundamental and homology groups

***** 49 free deformation of closed paths

***** 50 fundamental group and deformation of mappings

***** 51 the fundamental group at a point

***** 52 the fundamental group of a composite complex

*** 8 covering complexes

***** intro

      - ><

***** 53 unbranched covering complexes

***** 54 base path and covering path

