person/seifert.html

<div id="outline-container-org670fc4" class="outline-4">
<h4 id="org670fc4">9 n-simplexes</h4>
</div>

<div id="outline-container-org3cb6208" class="outline-4">
<h4 id="org3cb6208">10 simplicial complexes</h4>
</div>

<div id="outline-container-orgc9b2eeb" class="outline-4">
<h4 id="orgc9b2eeb">11 the schema of a simplicial complex</h4>
</div>

<div id="outline-container-orgce6c004" class="outline-4">
<h4 id="orgce6c004">12 finite, pure, homogeneous complexes</h4>
</div>

<div id="outline-container-org13ca656" class="outline-4">
<h4 id="org13ca656">13 normal subdivision</h4>
</div>

<div id="outline-container-org6ef5ed5" class="outline-4">
<h4 id="org6ef5ed5">14 examples of complexes</h4>
</div>
</div>

<div id="outline-container-org9a8dd0" class="outline-3">
<h3 id="org9a8dd0">3 homology groups</h3>
<div class="outline-text-3" id="text-org9a8dd0">
</div><div id="outline-container-org26171ee" class="outline-4">
<h4 id="org26171ee">15 chains</h4>
</div>

<div id="outline-container-org6d07a80" class="outline-4">
<h4 id="org6d07a80">16 boundary, closed chains</h4>
</div>

<div id="outline-container-orgc1deb97" class="outline-4">
<h4 id="orgc1deb97">17 homologous chains</h4>
</div>

<div id="outline-container-org83546da" class="outline-4">
<h4 id="org83546da">18 homology groups</h4>
</div>

<div id="outline-container-org22dd115" class="outline-4">
<h4 id="org22dd115">19 computation of the homology groups in simple cases</h4>
</div>

<div id="outline-container-orgaf874a5" class="outline-4">
<h4 id="orgaf874a5">20 homologies with division</h4>
</div>

<div id="outline-container-org850052d" class="outline-4">
<h4 id="org850052d">21 computation of homology groups from the incidence matrices</h4>
</div>

<div id="outline-container-org219f62f" class="outline-4">
<h4 id="org219f62f">22 block chains</h4>
</div>

<div id="outline-container-orge9c1a88" class="outline-4">
<h4 id="orge9c1a88">23 chains mod 2, connectivity numbers, euler's formula</h4>
</div>

<div id="outline-container-orgeabf1f9" class="outline-4">
<h4 id="orgeabf1f9">24 pseudomanifolds and orientability</h4>
</div>
</div>

<div id="outline-container-orge2987ae" class="outline-3">
<h3 id="orge2987ae">4 simplicial approximations</h3>
<div class="outline-text-3" id="text-orge2987ae">
</div><div id="outline-container-org6c5d110" class="outline-4">
<h4 id="org6c5d110">25 singular simplexes</h4>
</div>

<div id="outline-container-org622388c" class="outline-4">
<h4 id="org622388c">26 singular chains</h4>
</div>

<div id="outline-container-org90e8734" class="outline-4">
<h4 id="org90e8734">27 singular homology groups</h4>
</div>

<div id="outline-container-orgdc56332" class="outline-4">
<h4 id="orgdc56332">28 the approximation theorem, invariance of simplicial homology groups</h4>
</div>

<div id="outline-container-org51559c6" class="outline-4">
<h4 id="org51559c6">29 prisms in euclidean spaces</h4>
</div>

<div id="outline-container-org713b1ee" class="outline-4">
<h4 id="org713b1ee">30 proof of the approximation theorem</h4>
</div>

<div id="outline-container-org5120446" class="outline-4">
<h4 id="org5120446">31 deformation and simplicial approximation of mappings</h4>
</div>
</div>

<div id="outline-container-org5da6f53" class="outline-3">
<h3 id="org5da6f53">5 local properties</h3>
<div class="outline-text-3" id="text-org5da6f53">
</div><div id="outline-container-org8482184" class="outline-4">
<h4 id="org8482184">32 homology groups of a complex at a point</h4>
</div>

<div id="outline-container-org974e238" class="outline-4">
<h4 id="org974e238">33 invariance of dimension</h4>
</div>

<div id="outline-container-org8a668b3" class="outline-4">
<h4 id="org8a668b3">34 invariance of the purity of a complex</h4>
</div>

<div id="outline-container-org192aabf" class="outline-4">
<h4 id="org192aabf">35 invariance of boundary</h4>
</div>

<div id="outline-container-org581015d" class="outline-4">
<h4 id="org581015d">36 invariance of pseudomanifolds and of orientability</h4>
</div>
</div>

<div id="outline-container-orgf8afe5d" class="outline-3">
<h3 id="orgf8afe5d">6 surface topology</h3>
<div class="outline-text-3" id="text-orgf8afe5d">
</div><div id="outline-container-orgb6432d3" class="outline-4">
<h4 id="orgb6432d3">intro</h4>
<div class="outline-text-4" id="text-orgb6432d3">
<ul class="org-ul">
<li><p><p></p><p>The principal problem of topology,</p><p>the homeomorphism problem,</p><p>can be solved in dimension 2,</p><p>using methods which cannot be generalized to higher dimensions.</p><p></p></p><p></p><p><p></p><p>For this reason we shall develop surface topology</p><p>independently of our previous results,</p><p>which were valid for arbitrary dimension.</p><p></p></p><p></p><p><p></p><p>We shall start with polygons,</p><p>instead of with a simplicial complex,</p><p>and we shall construct closed polyhedral surfaces</p><p>by identifying sides of polygons.</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org2c8c5ac" class="outline-4">
<h4 id="org2c8c5ac">37 closed surfaces</h4>
<div class="outline-text-4" id="text-org2c8c5ac">
<ul class="org-ul">
<li><p>[manifold-checker]</p><p>We first devote our attention only to systems of polygons</p><p>for which the total number of sides is even</p><p>and each side is paired with exactly one otherside</p><p>by the topological mapping.</p></li>

<li><p>[topological feeling [neighborhood space]]</p><p>In the system of polygons,</p><p>points which map into one another</p><p>are to be considered equivalent</p><p>in the sense that</p><p>points in a neighborhood space are equivalent.</p></li>

<li><p>[combinatorial natural of a system of polygons]</p><p>We can then recognize the following classes of equivalent points</p><p>in a system of polygons :</p><p><ul class="org-ul"></p><p><li><p>an inner point of a polygon is equivalent only to itself;</p></li></p><p><li><p>an innerpoint of a polygonal side</p><p>is equivalent to exactly one other point;</p></li></p><p><li><p>a vertex may be equivalent to one, several, or even no other points.</p></li></ul></p></li>

<li><p>[connectedness condition]</p></li>

<li><p>system of polygons -&gt; closed surfaces</p></li>

<li><p><p></p><p>In the treatment which follows,</p><p>our interest shall be not in the particular system of polygons</p><p>but, rather, in the surface which it determines.</p><p></p></p><p></p><p><p></p><p>We now set ourselves the task of discovering</p><p>when two systems of polygons determine the same surface,</p><p>that is, finding when the polyhedral surfaces</p><p>produced by the identification of equivalent points</p><p>are different polygonal decompositions of the same surface.</p><p></p></p><p></p><p><p></p><p>[we solve this by normalization]</p><p></p></p></li>

<li><p>[orientation]</p><p>We now orient the polygonal sides.</p><p>That is, we choose one of the two boundary points of each side</p><p>as initial point</p><p>and the other as endpoint of the side.</p><p></p><p><ul class="org-ul"></p><p><li><p>x -</p><p>such orientation is nothing but maintain the information</p><p>of different positions in the boundary of a n-disk.</p></li></p><p></p><p><li><p><p></p><p>k -</p><p>but a polygon only has two orientations.</p><p></p></p><p></p><p><p></p><p>while so much information are maintained,</p><p>are they really the information about orientation ?</p><p></p></p></li></ul></p></li>

<li><p><p></p><p>The orientation of the polygon</p><p>will determine a sense of traversal of the boundary,</p><p>that is, a cyclic ordering of the sides.</p><p></p></p><p></p><p><p></p><p>[is this the same for polyhedron ?]</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-org7563ee6" class="outline-4">
<h4 id="org7563ee6">38 transformation to normal form</h4>
<div class="outline-text-4" id="text-org7563ee6">
</div><ul class="org-ul"><li><a id="org8f82cf2"></a>Step 1<br  /></li>

<li><a id="orga091747"></a>Step 2: Side Cancellation<br  /></li>

<li><a id="org766fe31"></a>Step 3: Transformation to a Polyhedral Surface Having a Single Vertex<br  /></li>

<li><a id="org733b719"></a>Step 4: Cross-Cap Normalization<br  /></li>

<li><a id="orgc21a29c"></a>Step 5: Handle Normalization<br  /></li>

<li><a id="org2dc3d3c"></a>Step 6: Transformation of the Handles into Cross-Caps<br  /></li></ul>
</div>

<div id="outline-container-orga3020e0" class="outline-4">
<h4 id="orga3020e0">39 types of normal form: the principal theorem</h4>
</div>

<div id="outline-container-org10f4374" class="outline-4">
<h4 id="org10f4374">40 surfaces with boundary</h4>
</div>

<div id="outline-container-orgdb7f74d" class="outline-4">
<h4 id="orgdb7f74d">41 homology groups of surfaces</h4>
</div>
</div>

<div id="outline-container-org75fcd58" class="outline-3">
<h3 id="org75fcd58">7 the fundamental group</h3>
<div class="outline-text-3" id="text-org75fcd58">
</div><div id="outline-container-org2243fd2" class="outline-4">
<h4 id="org2243fd2">42 the fundamental group</h4>
</div>

<div id="outline-container-orgafe8860" class="outline-4">
<h4 id="orgafe8860">43 examples</h4>
</div>

<div id="outline-container-orga2c571b" class="outline-4">
<h4 id="orga2c571b">44 the edge path group of a simplicial complex</h4>
</div>

<div id="outline-container-orge07eca7" class="outline-4">
<h4 id="orge07eca7">45 the edge path group of a surface complex</h4>
</div>

<div id="outline-container-orgc6ada70" class="outline-4">
<h4 id="orgc6ada70">46 generators and relations</h4>
</div>

<div id="outline-container-org78b9965" class="outline-4">
<h4 id="org78b9965">47 edge complexes and closed surfaces</h4>
</div>

<div id="outline-container-orgfc0ddb" class="outline-4">
<h4 id="orgfc0ddb">48 the fundamental and homology groups</h4>
</div>

<div id="outline-container-org43c17d4" class="outline-4">
<h4 id="org43c17d4">49 free deformation of closed paths</h4>
</div>

<div id="outline-container-org96f7f8e" class="outline-4">
<h4 id="org96f7f8e">50 fundamental group and deformation of mappings</h4>
</div>

<div id="outline-container-org9a56cf0" class="outline-4">
<h4 id="org9a56cf0">51 the fundamental group at a point</h4>
</div>

<div id="outline-container-orgf0d56b0" class="outline-4">
<h4 id="orgf0d56b0">52 the fundamental group of a composite complex</h4>
</div>
</div>

<div id="outline-container-org6a661d0" class="outline-3">
<h3 id="org6a661d0">8 covering complexes</h3>
<div class="outline-text-3" id="text-org6a661d0">
</div><div id="outline-container-orge0beba0" class="outline-4">
<h4 id="orge0beba0">intro</h4>
<div class="outline-text-4" id="text-orge0beba0">
<ul class="org-ul">
<li><p>&gt;&lt;</p></li></ul>
</div>
</div>

<div id="outline-container-org587d248" class="outline-4">
<h4 id="org587d248">53 unbranched covering complexes</h4>
</div>

<div id="outline-container-org9d662df" class="outline-4">
<h4 id="org9d662df">54 base path and covering path</h4>
</div>
