person/seifert.org
***** 55 coverings and subgroups of the fundamental group

***** 56 universal coverings

***** 57 regular coverings

***** 58 the monodromy group

*** 9 3-dimensional manifolds

***** 59 general principles

***** 60 representation by a polyhedron

      - [full polyhedron]
        full (solid) polyhedron is defined as the following,
        a closed 3-ball (or a topological image of a closed 3-ball)
        whose boundary been divided into polygons
        so that the following conditions are satisfied :
        1. each polygon is at least a 2-gon.
        2. each point of boundary belongs to at least one polygon.
        3. two polygons are either disjoint
           or have certain common edges or vertices.

        for example :
        - solid dodecahedron.
        - a closed 3-ball
          whose boundary sphere has been decomposed into two hemispheres
          by a great circle also becomes a full polyhedron
          when one subdivides the great circle by two or more vertices.

      - x -
        使用三角形
        也許可以大大簡化描述二階代數時 所需語言的語法之複雜度

        當考慮 polyhedron 所構造的三維流形時
        manifold-checker 很簡單
        就是 euler number 爲 0

        現在要問的是
        這個 manifold-checker 對 manifold 的 2-skeleton
        有什麼限制
        [我們已經知道找個 2-skeleton 不能是任意的有限生成羣了]

        知道這些限制之後
        我們就可以試着模仿二階的情形來設計 normalization 算法

        同時也可以試着模仿 Dehn 的算法
        來設計相似的算法
        以判斷二階代數中任意兩個元素是否相等

***** 61 homology groups

***** 62 the fundamental group

***** 63 the heegaard diagram

***** 64 3-dimensional manifolds with boundary

***** 65 construction of 3-dimensional manifolds out of knots

*** 10 n-dimensional manifolds

***** 66 star complexes

***** 67 cell complexes

***** 68 manifolds

***** 69 the poincare duality theorem

***** 70 intersection numbers of cell chains

***** 71 dual bases

***** 72 cellular approximations

***** 73 intersection numbers of singular chains

***** 74 invariance of intersection numbers

***** 75 examples

***** 76 orientability and two-sidedness

***** 77 linking numbers

*** 11 continuous mappings

***** 78 the degree of a mappings

***** 79 a trace formula

***** 80 a fixed point formula

***** 81 applications

*** 12 auxiliary theorems from the theory of groups

***** 82 generators and relations

***** 83 homomorphic mappings and factor groups

***** 84 abelianization of groups

***** 85 free and direct products

***** 86 abelian groups

***** 87 the normal form of integer matrices

* [topology of 3-dimensional fibered spaces]

*** fibered spaces

*** orbit surface

*** fiberings of s3

*** triangulations of fibered spaces

*** drilling and filling (surgery)

*** classes of fibered spaces

*** the orientable fibered spaces

*** the nonorientable fibered spaces

*** covering spaces

*** fundamental groups of fibered spaces

*** fiberings of the 3-sphere (complete list)

*** the fibered poincare spaces

*** constructing poincare spaces from torus knots

*** translation groups of fibered spaces

*** spaces which cannot be fibered

*** appendix: branched coverings
