person/seifert.html

<div id="outline-container-orgf6e99ae" class="outline-4">
<h4 id="orgf6e99ae">55 coverings and subgroups of the fundamental group</h4>
</div>

<div id="outline-container-orgf3b8aea" class="outline-4">
<h4 id="orgf3b8aea">56 universal coverings</h4>
</div>

<div id="outline-container-org8401882" class="outline-4">
<h4 id="org8401882">57 regular coverings</h4>
</div>

<div id="outline-container-org9f7d797" class="outline-4">
<h4 id="org9f7d797">58 the monodromy group</h4>
</div>
</div>

<div id="outline-container-org6d06421" class="outline-3">
<h3 id="org6d06421">9 3-dimensional manifolds</h3>
<div class="outline-text-3" id="text-org6d06421">
</div><div id="outline-container-orgfe7eefc" class="outline-4">
<h4 id="orgfe7eefc">59 general principles</h4>
</div>

<div id="outline-container-orgfd7f7ff" class="outline-4">
<h4 id="orgfd7f7ff">60 representation by a polyhedron</h4>
<div class="outline-text-4" id="text-orgfd7f7ff">
<ul class="org-ul">
<li><p><p></p><p>[full polyhedron]</p><p>full (solid) polyhedron is defined as the following,</p><p>a closed 3-ball (or a topological image of a closed 3-ball)</p><p>whose boundary been divided into polygons</p><p>so that the following conditions are satisfied :</p><p></p></p><p><ol class="org-ol"></p><p><li>each polygon is at least a 2-gon.</li></p><p><li>each point of boundary belongs to at least one polygon.</li></p><p><li>two polygons are either disjoint</p><p>or have certain common edges or vertices.</li></ol></p><p><p></p><p>for example :</p><p></p></p><p><ul class="org-ul"></p><p><li><p>solid dodecahedron.</p></li></p><p><li><p>a closed 3-ball</p><p>whose boundary sphere has been decomposed into two hemispheres</p><p>by a great circle also becomes a full polyhedron</p><p>when one subdivides the great circle by two or more vertices.</p></li></ul></p></li>

<li><p><p></p><p>x -</p><p>使用三角形</p><p>也許可以大大簡化描述二階代數時 所需語言的語法之複雜度</p><p></p></p><p></p><p><p></p><p>當考慮 polyhedron 所構造的三維流形時</p><p>manifold-checker 很簡單</p><p>就是 euler number 爲 0</p><p></p></p><p></p><p><p></p><p>現在要問的是</p><p>這個 manifold-checker 對 manifold 的 2-skeleton</p><p>有什麼限制</p><p>[我們已經知道找個 2-skeleton 不能是任意的有限生成羣了]</p><p></p></p><p></p><p><p></p><p>知道這些限制之後</p><p>我們就可以試着模仿二階的情形來設計 normalization 算法</p><p></p></p><p></p><p><p></p><p>同時也可以試着模仿 Dehn 的算法</p><p>來設計相似的算法</p><p>以判斷二階代數中任意兩個元素是否相等</p><p></p></p></li></ul>
</div>
</div>

<div id="outline-container-orge75224b" class="outline-4">
<h4 id="orge75224b">61 homology groups</h4>
</div>

<div id="outline-container-org9deb993" class="outline-4">
<h4 id="org9deb993">62 the fundamental group</h4>
</div>

<div id="outline-container-orgb9619a0" class="outline-4">
<h4 id="orgb9619a0">63 the heegaard diagram</h4>
</div>

<div id="outline-container-orgb5ddcf" class="outline-4">
<h4 id="orgb5ddcf">64 3-dimensional manifolds with boundary</h4>
</div>

<div id="outline-container-org8731e58" class="outline-4">
<h4 id="org8731e58">65 construction of 3-dimensional manifolds out of knots</h4>
</div>
</div>

<div id="outline-container-orgba47678" class="outline-3">
<h3 id="orgba47678">10 n-dimensional manifolds</h3>
<div class="outline-text-3" id="text-orgba47678">
</div><div id="outline-container-org2f1da8a" class="outline-4">
<h4 id="org2f1da8a">66 star complexes</h4>
</div>

<div id="outline-container-org84c7fac" class="outline-4">
<h4 id="org84c7fac">67 cell complexes</h4>
</div>

<div id="outline-container-org554ab6a" class="outline-4">
<h4 id="org554ab6a">68 manifolds</h4>
</div>

<div id="outline-container-org510ca6c" class="outline-4">
<h4 id="org510ca6c">69 the poincare duality theorem</h4>
</div>

<div id="outline-container-orgc4df8c0" class="outline-4">
<h4 id="orgc4df8c0">70 intersection numbers of cell chains</h4>
</div>

<div id="outline-container-org55491fb" class="outline-4">
<h4 id="org55491fb">71 dual bases</h4>
</div>

<div id="outline-container-org491b98e" class="outline-4">
<h4 id="org491b98e">72 cellular approximations</h4>
</div>

<div id="outline-container-org8c968d5" class="outline-4">
<h4 id="org8c968d5">73 intersection numbers of singular chains</h4>
</div>

<div id="outline-container-org2cbff4" class="outline-4">
<h4 id="org2cbff4">74 invariance of intersection numbers</h4>
</div>

<div id="outline-container-org5bc69ae" class="outline-4">
<h4 id="org5bc69ae">75 examples</h4>
</div>

<div id="outline-container-org983c01" class="outline-4">
<h4 id="org983c01">76 orientability and two-sidedness</h4>
</div>

<div id="outline-container-orgc2bf78c" class="outline-4">
<h4 id="orgc2bf78c">77 linking numbers</h4>
</div>
</div>

<div id="outline-container-org72b5ff9" class="outline-3">
<h3 id="org72b5ff9">11 continuous mappings</h3>
<div class="outline-text-3" id="text-org72b5ff9">
</div><div id="outline-container-org5fbb5f0" class="outline-4">
<h4 id="org5fbb5f0">78 the degree of a mappings</h4>
</div>

<div id="outline-container-orgef85df8" class="outline-4">
<h4 id="orgef85df8">79 a trace formula</h4>
</div>

<div id="outline-container-org8390b6b" class="outline-4">
<h4 id="org8390b6b">80 a fixed point formula</h4>
</div>

<div id="outline-container-orgdbaa53b" class="outline-4">
<h4 id="orgdbaa53b">81 applications</h4>
</div>
</div>

<div id="outline-container-orgb1042a4" class="outline-3">
<h3 id="orgb1042a4">12 auxiliary theorems from the theory of groups</h3>
<div class="outline-text-3" id="text-orgb1042a4">
</div><div id="outline-container-org10e05c1" class="outline-4">
<h4 id="org10e05c1">82 generators and relations</h4>
</div>

<div id="outline-container-orgd181b8c" class="outline-4">
<h4 id="orgd181b8c">83 homomorphic mappings and factor groups</h4>
</div>

<div id="outline-container-org707c55c" class="outline-4">
<h4 id="org707c55c">84 abelianization of groups</h4>
</div>

<div id="outline-container-org1348852" class="outline-4">
<h4 id="org1348852">85 free and direct products</h4>
</div>

<div id="outline-container-org11d6d06" class="outline-4">
<h4 id="org11d6d06">86 abelian groups</h4>
</div>

<div id="outline-container-orgd43a83e" class="outline-4">
<h4 id="orgd43a83e">87 the normal form of integer matrices</h4>
</div>
</div>
</div>

<div id="outline-container-org4377545" class="outline-2">
<h2 id="org4377545">[topology of 3-dimensional fibered spaces]</h2>
<div class="outline-text-2" id="text-org4377545">
</div><div id="outline-container-org855e0fb" class="outline-3">
<h3 id="org855e0fb">fibered spaces</h3>
</div>

<div id="outline-container-org68fc307" class="outline-3">
<h3 id="org68fc307">orbit surface</h3>
</div>

<div id="outline-container-org982f86a" class="outline-3">
<h3 id="org982f86a">fiberings of s3</h3>
</div>

<div id="outline-container-org7655254" class="outline-3">
<h3 id="org7655254">triangulations of fibered spaces</h3>
</div>

<div id="outline-container-org699400a" class="outline-3">
<h3 id="org699400a">drilling and filling (surgery)</h3>
</div>

<div id="outline-container-org4659de5" class="outline-3">
<h3 id="org4659de5">classes of fibered spaces</h3>
</div>

<div id="outline-container-orgf4175cd" class="outline-3">
<h3 id="orgf4175cd">the orientable fibered spaces</h3>
</div>

<div id="outline-container-orgf8f1fc1" class="outline-3">
<h3 id="orgf8f1fc1">the nonorientable fibered spaces</h3>
</div>

<div id="outline-container-org9e9ed6c" class="outline-3">
<h3 id="org9e9ed6c">covering spaces</h3>
</div>

<div id="outline-container-org911be3a" class="outline-3">
<h3 id="org911be3a">fundamental groups of fibered spaces</h3>
</div>

<div id="outline-container-orga96b1a1" class="outline-3">
<h3 id="orga96b1a1">fiberings of the 3-sphere (complete list)</h3>
</div>

<div id="outline-container-orgcb39b59" class="outline-3">
<h3 id="orgcb39b59">the fibered poincare spaces</h3>
</div>

<div id="outline-container-org5e0b10c" class="outline-3">
<h3 id="org5e0b10c">constructing poincare spaces from torus knots</h3>
</div>

<div id="outline-container-org7d80108" class="outline-3">
<h3 id="org7d80108">translation groups of fibered spaces</h3>
</div>

<div id="outline-container-orgfffd0b8" class="outline-3">
<h3 id="orgfffd0b8">spaces which cannot be fibered</h3>
</div>

<div id="outline-container-org1d8e034" class="outline-3">
<h3 id="org1d8e034">appendix: branched coverings</h3>
</div>
</div>
</div>
<div id="postamble" class="status">
近死之心 莫使復陽也
</div>
</body>
</html>
